Revit 2026 API

# StringParameterValue(String) Constructor

---

Value constructor

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public StringParameterValue(
	string value
)
```
```vb
Public Sub New (
	value As String
)
```
```cpp
public:
StringParameterValue(
	String^ value
)
```
```fsharp
new :
        value : string -> StringParameterValue
```

#### Parameters

value String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

StringParameterValue Class

StringParameterValue Overload

Autodesk.Revit.DB Namespace